tutorials/cases/LEIgasifierDEM/0.orig/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// DEM-derived bed descent field: FoamCoupling maps sphere velocities onto
// solid cells each coupling step (isGaussianInterp, see MPI_lambda.py), so
// unlike LEIgasifierPrescribedUs there is no static solve to seed this from.
// Spheres start at rest under gravity -- uniform zero is the correct IC.
internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            zeroGradient;
    }
    sides
    {
        type            empty;
    }
}
