tutorials/cases/LEIgasifierDEM/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Script: system/make_mesh.py                     |
|   \  /    A nd           | Time: 2026-06-01 14:32:57.191055                |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-0.15000000 -0.00800000 0.00000000) // 0
	(0.15000000 -0.00800000 0.00000000) // 1
	(0.15000000 -0.00800000 0.20000000) // 2
	(-0.15000000 -0.00800000 0.20000000) // 3
	(-0.15000000 -0.02400000 0.00000000) // 4
	(0.15000000 -0.02400000 0.00000000) // 5
	(0.15000000 -0.02400000 0.20000000) // 6
	(-0.15000000 -0.02400000 0.20000000) // 7
	(0.08000000 -0.00800000 0.30000000) // 8
	(-0.08000000 -0.00800000 0.30000000) // 9
	(0.08000000 -0.02400000 0.30000000) // 10
	(-0.08000000 -0.02400000 0.30000000) // 11
	(0.08000000 -0.00800000 0.32000000) // 12
	(-0.08000000 -0.00800000 0.32000000) // 13
	(0.08000000 -0.02400000 0.32000000) // 14
	(-0.08000000 -0.02400000 0.32000000) // 15
	(0.15000000 -0.00800000 0.42000000) // 16
	(-0.15000000 -0.00800000 0.42000000) // 17
	(0.15000000 -0.02400000 0.42000000) // 18
	(-0.15000000 -0.02400000 0.42000000) // 19
	(0.15000000 -0.00800000 1.00000000) // 20
	(-0.15000000 -0.00800000 1.00000000) // 21
	(0.15000000 -0.02400000 1.00000000) // 22
	(-0.15000000 -0.02400000 1.00000000) // 23
	(0.20000000 -0.00800000 0.42000000) // 24
	(0.20000000 -0.00800000 1.00000000) // 25
	(0.20000000 -0.02400000 0.42000000) // 26
	(0.20000000 -0.02400000 1.00000000) // 27
	(-0.20000000 -0.00800000 0.42000000) // 28
	(-0.20000000 -0.00800000 1.00000000) // 29
	(-0.20000000 -0.02400000 0.42000000) // 30
	(-0.20000000 -0.02400000 1.00000000) // 31
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 10 7 1 ) simpleGrading ( 1 1 1 ) // 0 
	hex ( 3 2 8 9 7 6 10 11 )  ( 10 5 1 ) simpleGrading ( 1 1 1 ) // 1 
	hex ( 9 8 12 13 11 10 14 15 )  ( 10 1 1 ) simpleGrading ( 1 1 1 ) // 2 
	hex ( 13 12 16 17 15 14 18 19 )  ( 10 5 1 ) simpleGrading ( 1 1 1 ) // 3 
	hex ( 17 16 20 21 19 18 22 23 )  ( 10 20 1 ) simpleGrading ( 1 1 1 ) // 4 
	hex ( 16 24 25 20 18 26 27 22 )  ( 2 20 1 ) simpleGrading ( 1 1 1 ) // 5 
	hex ( 28 17 21 29 30 19 23 31 )  ( 2 20 1 ) simpleGrading ( 1 1 1 ) // 6 
);

edges
(
);

boundary
(
	sides
	{
		type empty;
		faces
		(
			(17 16 20 21)
			(28 17 21 29)
			(9 8 12 13)
			(30 19 23 31)
			(18 26 27 22)
			(13 12 16 17)
			(19 18 22 23)
			(15 14 18 19)
			(16 24 25 20)
			(0 1 2 3)
			(7 6 10 11)
			(3 2 8 9)
			(4 5 6 7)
			(11 10 14 15)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(4 5 1 0)
		);
	}

	wall
	{
		type wall;
		faces
		(
			(4 0 3 7)
			(30 28 29 31)
			(15 13 17 19)
			(26 24 25 27)
			(10 8 12 14)
			(6 2 8 10)
			(7 3 9 11)
			(11 9 13 15)
			(14 12 16 18)
			(5 1 2 6)
		);
	}

	inlet
	{
		type patch;
		faces
		(
			(23 22 20 21)
			(31 23 21 29)
			(22 27 25 20)
		);
	}

);

faces
(
);

mergePatchPairs
(
);

scale 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
